<?php
session_start();

// التحقق مما إذا كان المستخدم قد سجل الدخول
if (!isset($_SESSION['user_id'])) {
    header("Location: /login.php");
    exit();
}

$isAdmin = isset($_SESSION['isAdmin']) ? $_SESSION['isAdmin'] : 0;
$search_query = isset($_GET['search']) && !empty(trim($_GET['search'])) ? htmlspecialchars(trim($_GET['search'])) : '';
?>

<!DOCTYPE html>
<html lang="ru">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Библиотека</title>
    <link rel="stylesheet" href="/main.css">
    <link rel="stylesheet" href="about.css">
</head>
<body>
    <div class="container">
    <?php include '../header.php'; ?>
        <main>
            <h1>О библиотеке</h1>
            <div id="info">
                <p>
                    Добро пожаловать в нашу удивительную библиотеку! Мы - современное пространство, где каждый найдет что-то по своему вкусу. У нас собрана огромная коллекция книг, которые погрузят вас в мир фантазий, приключений и знаний. Здесь каждая страница проникнута магией слов, а каждый из наших читателей становится частью этой волшебной атмосфера.
                </p>
                <p>
                    Библиотека не только предоставляет доступ к богатому выбору литературы, но и является идеальным местом для проведения различных мероприятий и встреч. У нас проводятся литературные клубы, кружки по изучению языков, авторские вечера и многое другое. Мы уверены, что каждый читатель найдет у нас что-то, что заинтересует и вдохновит его на новые открытия и путешествия в мир фантазии и знаний.
                </p>
                <p>
                    Хотите погрузиться в прошлое? Мы представляем вам уникальную возможность прикоснуться к истории и культуре большого числа стран; похвастаемся коллекцией редких и старинных книг, охраняемых с особым трепетом. У нас есть эксклюзивные переплеты, иллюстрации, артефакты и рукописи, которые разбудят в вас чувство удивления и увлеченности.
                </p>
                <p>
                    В нашей библиотеке также действует современная электронная система каталогизации и дистанционного доступа. Вы можете легко найти нужную вам книгу, воспользовавшись нашим удобным онлайн-каталогом и забрать ее на выдаче. Мы ценим ваше время и комфорт, поэтому постоянно работаем над совершенствованием нашей системы и предлагаем новые технологии обслуживания.
                </p>
                <p>
                    Связаться с нами вы можете по номеру телефона: <a href="tel:+78612743227">8 (861) 274-32-27</a> или написав на электронную почту <a href="mailto:krd.library@mail.ru">krd.library@mail.ru</a><br>
                    Мы находимся по адресу г. Краснодар, ул. Красная, 87. Приходите, мы всегда рады вас видеть!
                </p>
            </div>
            <iframe id="map" src="https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d1409.8260813670875!2d38.972195425039025!3d45.031986129144705!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x40f04fa2e8670a35%3A0x8f737041a74042ec!2z0YPQuy4g0JrRgNCw0YHQvdCw0Y8sIDg3LCDQmtGA0LDRgdC90L7QtNCw0YAsINCa0YDQsNGB0L3QvtC00LDRgNGB0LrQuNC5INC60YDQsNC5LCAzNTAwMDA!5e0!3m2!1sru!2sru!4v1705041729750!5m2!1sru!2sru" width="800" height="650" style="border:0;" allowfullscreen="" loading="lazy" referrerpolicy="no-referrer-when-downgrade"></iframe>
        </main>
        <footer>
        </footer>
    </div>
</body>
</html>